textEditors/.emacs.d/emacs.org
#+TITLE: Emacs configuration
#+AUTHOR: Lucas Teixeira
#+PROPERTY: header-args:emacs-lisp :tangle ~/dotfiles/textEditors/.emacs.d/init.el
#
* Features to check / Configure
+ Marks
+ Org:
  + Create bullet of the same level using "C-RET"
+ Folding
+ C++
+ Bash
+ Selective display C-x $
+ Indirect buffers
+ How to enable a mode at startup? fill-column-indicator
+ Tangle on save
+ Enter on commit buffer in insert mode
+ imenu: move around the buffer using a menu 
  
;; Highlight yanked region
;; (defun bretx/evil-yank-advice (orig-fn beg end &rest args)
;;   "Advice to be added to `evil-yank' to highlight yanked region.  Pass ORIG-FN, BEG, END, TYPE, ARGS."
;;   (pulse-momentary-highlight-region beg end
;;                                     'company-template-field)
;;   (apply orig-fn beg end args))
;; (advice-add 'evil-yank :around 'bretx/evil-yank-advice)


* Begin config
#+begin_src emacs-lisp
;;; package --- Summary
;; No summary is provided, since this config is organized using an org file.
;;
;;; Commentary:
;; This config should be modified using its companion org file.
;;; Code:
#+end_src


* Global stuff
** Package management
To refresh the repository, run "package-refresh-contents".
#+begin_src emacs-lisp
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			     ("org" . "https://orgmode.org/elpa/")
			     ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

** UI/UX
#+begin_src emacs-lisp
(setq inhibit-startup-message t)

(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(set-fringe-mode 10)

(menu-bar-mode -1)

(setq visible-bell t)
(setq-default fill-column 100)
#+end_src

** Fonts and themes
#+begin_src emacs-lisp
(set-face-attribute 'default nil :font "mononoki" :height 170)

(use-package doom-themes
  :init (load-theme 'doom-dracula t))
#+end_src

** Keybindings
Global keybindings
#+begin_src emacs-lisp
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
(global-set-key (kbd "<f4>"    ) 'ranger)
(global-set-key (kbd "<f5>"    ) 'eval-buffer)
(global-set-key (kbd "<f6>"    ) 'org-babel-tangle)
(global-set-key (kbd "<f7>"    ) 'magit)
(global-set-key (kbd "<f8>"    ) 'treemacs)
(global-set-key (kbd "<f9>"    ) 'follow-delete-other-windows-and-split)
(global-set-key (kbd "C-="     ) 'text-scale-increase)
(global-set-key (kbd "C--"     ) 'text-scale-decrease)
(global-set-key (kbd "C-c c"   ) 'comment-line)
(global-set-key (kbd "C-7"     ) 'save-buffer)
(global-set-key (kbd "C-8"     ) 'kill-current-buffer)
(global-set-key (kbd "C-M-j"   ) 'counsel-switch-buffer)
(global-set-key (kbd "M-H"     ) 'shrink-window-horizontally)
(global-set-key (kbd "M-L"     ) 'enlarge-window-horizontally)
(global-set-key (kbd "M-K"     ) 'shrink-window)
(global-set-key (kbd "M-J"     ) 'enlarge-window)
#+end_src

Unseting keys
#+begin_src emacs-lisp
  ;; (global-unset-key (kbd "M-d"))
  ;; (global-unset-key (kbd "M-a"))
  ;; (global-unset-key (kbd "M-s"))
#+end_src

** Load path
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.emacs.d/downloads/")
#+end_src

** Icons
Run M-x all-the-icons-install-fonts when loading this config in a new machine
#+begin_src emacs-lisp
(use-package all-the-icons)
#+end_src

** Modeline
https://github.com/seagle0128/doom-modeline
#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :config
  (setq doom-modeline-buffer-encoding nil)
  (setq doom-modeline-env-enable-python t))
#+end_src

** Line numbers
#+begin_src emacs-lisp
(column-number-mode)
(global-display-line-numbers-mode t)
(setq display-line-numbers-type 'relative)

;; Disable line numbers for some modes
(dolist (mode '(shell-mode-hook
		    term-mode-hook
		    eshell-mode-hook))
  ;; This is kind of a loop over the values in the list of modes
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Yes/No
Quicker yes or no
#+begin_src emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+end_src

** Directories
Backup and autosave somewhere else
#+begin_src emacs-lisp
(setq backup-directory-alist `((".*" . "~/.cache/emacs/backup")))
(setq auto-save-file-name-transforms `((".*" "~/.cache/emacs/autosave" t)))
(setq delete-by-moving-to-trash t)
(setq trash-directory "~/Trash")
#+end_src

** Confirm before exit
#+begin_src emacs-lisp
(setq confirm-kill-emacs 'y-or-n-p)
#+end_src

** Tab jump out
#+begin_src emacs-lisp
(use-package tab-jump-out
  :ensure t
  :hook (prog-mode . tab-jump-out-mode)
  :hook (LaTeX-mode . tab-jump-out-mode)
  :hook (org-mode . tab-jump-out-mode))
#+end_src

** Highlight line
Highlights the line where the cursor is.
#+begin_src emacs-lisp
(require 'hl-line)
(global-hl-line-mode t)
#+end_src

* Avy
https://github.com/abo-abo/avy
#+begin_src emacs-lisp
(use-package avy
  :ensure t
  :defer t)
(global-set-key (kbd "M-a") 'avy-goto-char)
(global-set-key (kbd "M-s") 'avy-goto-char-2)
#+end_src
* Company mode
Auto completion all over the place.
http://company-mode.github.io/
#+begin_src emacs-lisp
(use-package company
:ensure t
:config
(setq company-idle-delay 0)
(setq company-minimum-prefix-lenght 3)

(global-company-mode t))
#+end_src

* Counsel
#+begin_src emacs-lisp
(use-package counsel
  :bind (("M-x" . counsel-M-x)
	   ("C-x b" . counsel-ibuffer)
	   ("C-x C-f" . counsel-find-file)
  :map minibuffer-local-map
	 ("C-r" . 'counsel-minibuffer-history)))
#+end_src

* Dashboard
Splash screen for Emacs.
https://github.com/emacs-dashboard/emacs-dashboard
#+begin_src emacs-lisp
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook))
#+end_src

Configurations
#+begin_src emacs-lisp
  ;; Set the title
  (setq dashboard-banner-logo-title "Welcome to Emacs!")
  ;; Set the banner
  (setq dashboard-startup-banner 'logo)
  ;; Value can be
  ;; 'official which displays the official emacs logo
  ;; 'logo which displays an alternative emacs logo
  ;; 1, 2 or 3 which displays one of the text banners
  ;; "path/to/your/image.png" or "path/to/your/text.txt" which displays whatever image/text you would prefer

  ;; Content is not centered by default. To center, set
  (setq dashboard-center-content t)

  ;; To disable shortcut "jump" indicators for each section, set
  ;; (setq dashboard-show-shortcuts nil)

  (setq dashboard-items '((recents  . 5)
                          (bookmarks . 5)
                          (projects . 5)
                          (agenda . 5)))
                        
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  ;; (add-to-list 'dashboard-items '(agenda) t)
  ;; (setq dashboard-week-agenda t)
#+end_src
* Evil
https://github.com/emacs-evil/evil
** Base
#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-undo-system 'undo-tree)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "j") 'exit-insert-mode)
  (define-key evil-normal-state-map (kbd "j") 'evil-next-visual-line)
  (define-key evil-normal-state-map (kbd "k") 'evil-previous-visual-line)
  (define-key evil-normal-state-map (kbd "$") 'evil-end-of-visual-line)
  (define-key evil-normal-state-map (kbd "a") 'evil-append-line)
  (define-key evil-normal-state-map (kbd "A") 'evil-append)
  (define-key evil-normal-state-map (kbd "ç") 'save-buffer)

  ;; Set the initial state for a given mode
  (evil-set-initial-state 'shell-buffer-mode 'insert))

#+end_src
** Custom functions
Exits insert mode using jj.
#+begin_src emacs-lisp
(defun exit-insert-mode ()
  (interactive)
  (let ((ch (read-char-exclusive)))
    (if (eq ?j ch)
        (evil-force-normal-state)
      (insert "j" (string ch)))))
#+end_src

** Evil collection
https://github.com/emacs-evil/evil-collection
#+begin_src emacs-lisp
(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init))
#+end_src

** Evil snipe
https://github.com/hlissner/evil-snipe
#+begin_src emacs-lisp
(use-package evil-snipe)
(evil-snipe-mode +1)
(evil-snipe-override-mode +1)
(setq evil-snipe-scope 'whole-line)
#+end_src

Alias all brackets to "[".
#+begin_src emacs-lisp
(push '(?\[ "[[{(]") evil-snipe-aliases)
#+end_src

** Multi-edit
https://github.com/hlissner/evil-multiedit
#+begin_src emacs-lisp
(use-package evil-multiedit)
#+end_src
* Fill column indicator
Vertical line on the buffer
Hook prog mode
#+begin_src emacs-lisp
  ;; (require 'fill-column-indicator)
  ;; (setq fci-rule-width 1)
  ;; (setq fci-rule-color "blue")
  ;; (setq fci-rule-column 80)
#+end_src

* Flycheck
https://www.flycheck.org/en/latest/
#+begin_src emacs-lisp
(use-package flycheck)
(global-flycheck-mode)
#+end_src

* Helpful
A better Emacs help buffer.
https://github.com/Wilfred/helpful
#+begin_src emacs-lisp
(use-package helpful
  :defer t
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
#+end_src
* iedit
#+begin_src emacs-lisp
(use-package iedit
  :defer t)
(use-package evil-iedit-state) ;; check
;; check how to go to next/previous instance
(define-key global-map (kbd "C-c o") 'iedit-mode)
#+end_src

* Ivy
