textEditors/.emacs.d/init.el
;;; package --- Summary
;; No summary is provided, since this config is organized using an org file.
;;
;;; Commentary:
;; This config should be modified using its companion org file.
;;; Code:

(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			     ("org" . "https://orgmode.org/elpa/")
			     ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

(setq inhibit-startup-message t)

(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(set-fringe-mode 10)

(menu-bar-mode -1)

(setq visible-bell t)
(setq-default fill-column 100)

(set-face-attribute 'default nil :font "Roboto Mono Nerd Font" :height 100)

(use-package doom-themes
  :init (load-theme 'doom-dracula t))

(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
(global-set-key (kbd "<f4>"    ) 'ranger)
(global-set-key (kbd "<f5>"    ) 'eval-buffer)
(global-set-key (kbd "<f6>"    ) 'org-babel-tangle)
(global-set-key (kbd "<f7>"    ) 'magit)
(global-set-key (kbd "<f8>"    ) 'treemacs)
(global-set-key (kbd "<f9>"    ) 'follow-delete-other-windows-and-split)
(global-set-key (kbd "C-="     ) 'text-scale-increase)
(global-set-key (kbd "C--"     ) 'text-scale-decrease)
(global-set-key (kbd "C-c c"   ) 'comment-line)
(global-set-key (kbd "C-7"     ) 'save-buffer)
(global-set-key (kbd "C-8"     ) 'kill-current-buffer)
(global-set-key (kbd "C-M-j"   ) 'counsel-switch-buffer)
(global-set-key (kbd "M-H"     ) 'shrink-window-horizontally)
(global-set-key (kbd "M-L"     ) 'enlarge-window-horizontally)
(global-set-key (kbd "M-K"     ) 'shrink-window)
(global-set-key (kbd "M-J"     ) 'enlarge-window)

;; (global-unset-key (kbd "M-d"))
;; (global-unset-key (kbd "M-a"))
;; (global-unset-key (kbd "M-s"))

(add-to-list 'load-path "~/.emacs.d/downloads/")

(use-package all-the-icons)

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :config
  (setq doom-modeline-buffer-encoding nil)
  (setq doom-modeline-env-enable-python t))

(column-number-mode)
(global-display-line-numbers-mode t)
(setq display-line-numbers-type 'relative)

;; Disable line numbers for some modes
(dolist (mode '(shell-mode-hook
		    term-mode-hook
		    eshell-mode-hook))
  ;; This is kind of a loop over the values in the list of modes
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(fset 'yes-or-no-p 'y-or-n-p)

(setq backup-directory-alist `((".*" . "~/.cache/emacs/backup")))
(setq auto-save-file-name-transforms `((".*" "~/.cache/emacs/autosave" t)))
(setq delete-by-moving-to-trash t)
(setq trash-directory "~/Trash")

(setq confirm-kill-emacs 'y-or-n-p)

(use-package tab-jump-out
  :ensure t
  :hook (prog-mode . tab-jump-out-mode)
  :hook (LaTeX-mode . tab-jump-out-mode)
  :hook (org-mode . tab-jump-out-mode))

(require 'hl-line)
(global-hl-line-mode t)

(use-package avy
  :ensure t
  :defer t)
(global-set-key (kbd "M-a") 'avy-goto-char)
(global-set-key (kbd "M-s") 'avy-goto-char-2)

(use-package company
:ensure t
:config
(setq company-idle-delay 0)
(setq company-minimum-prefix-lenght 3)

(global-company-mode t))

(use-package counsel
  :bind (("M-x" . counsel-M-x)
	   ("C-x b" . counsel-ibuffer)
	   ("C-x C-f" . counsel-find-file)
  :map minibuffer-local-map
	 ("C-r" . 'counsel-minibuffer-history)))

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook))

;; Set the title
(setq dashboard-banner-logo-title "Welcome to Emacs!")
;; Set the banner
(setq dashboard-startup-banner 'logo)
;; Value can be
;; 'official which displays the official emacs logo
;; 'logo which displays an alternative emacs logo
;; 1, 2 or 3 which displays one of the text banners
;; "path/to/your/image.png" or "path/to/your/text.txt" which displays whatever image/text you would prefer

;; Content is not centered by default. To center, set
(setq dashboard-center-content t)

;; To disable shortcut "jump" indicators for each section, set
;; (setq dashboard-show-shortcuts nil)

(setq dashboard-items '((recents  . 5)
                        (bookmarks . 5)
                        (projects . 5)
                        (agenda . 5)))

(setq dashboard-set-heading-icons t)
(setq dashboard-set-file-icons t)
;; (add-to-list 'dashboard-items '(agenda) t)
;; (setq dashboard-week-agenda t)

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-undo-system 'undo-tree)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "j") 'exit-insert-mode)
  (define-key evil-normal-state-map (kbd "j") 'evil-next-visual-line)
  (define-key evil-normal-state-map (kbd "k") 'evil-previous-visual-line)
  (define-key evil-normal-state-map (kbd "$") 'evil-end-of-visual-line)
  (define-key evil-normal-state-map (kbd "a") 'evil-append-line)
  (define-key evil-normal-state-map (kbd "A") 'evil-append)
  (define-key evil-normal-state-map (kbd "ç") 'save-buffer)

  ;; Set the initial state for a given mode
  (evil-set-initial-state 'shell-buffer-mode 'insert))

(defun exit-insert-mode ()
  (interactive)
  (let ((ch (read-char-exclusive)))
    (if (eq ?j ch)
        (evil-force-normal-state)
      (insert "j" (string ch)))))

(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init))

(use-package evil-snipe)
(evil-snipe-mode +1)
(evil-snipe-override-mode +1)
(setq evil-snipe-scope 'whole-line)

(push '(?\[ "[[{(]") evil-snipe-aliases)

(use-package evil-multiedit)

;; (require 'fill-column-indicator)
;; (setq fci-rule-width 1)
;; (setq fci-rule-color "blue")
;; (setq fci-rule-column 80)

(use-package flycheck)
(global-flycheck-mode)

(use-package helpful
  :defer t
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(use-package iedit
  :defer t)
(use-package evil-iedit-state) ;; check
;; check how to go to next/previous instance
(define-key global-map (kbd "C-c o") 'iedit-mode)

(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
