textEditors/.emacs.d/emacs.org
** Base
#+begin_src emacs-lisp
(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
	   :map ivy-minibuffer-map
	   ("TAB" . ivy-alt-done)
	   ("C-l" . ivy-alt-done)
	   ("C-j" . ivy-next-line)
	   ("C-k" . ivy-previous-line)
	   :map ivy-switch-buffer-map
	   ("C-k" . ivy-previous-line)
	   ("C-l" . ivy-done)
	   ("C-d" . ivy-switch-buffer-kill)
	   :map ivy-reverse-i-search-map
	   ("C-k" . ivy-previous-line)
	   ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))
#+end_src

** Posframe
https://github.com/tumashu/ivy-posframe
#+begin_src emacs-lisp
  ;; (require 'ivy-posframe)

  ;; (setq ivy-posframe-height-alist '((swiper . 20)
  ;;                                   (t      . 20)))
                    
  ;; (setq ivy-posframe-parameters
  ;;   '((left-fringe . 20)
  ;;     (left-fringe . 0)))


  ;;  (setq ivy-posframe-display-functions-alist
  ;;        '((swiper          . ivy-display-function-fallback)
  ;;          (counsel-M-x     . ivy-posframe-display-at-frame-top-center)
  ;;          (t               . ivy-posframe-display)))
  ;;  (ivy-posframe-mode nil)
#+end_src
** Ivy rich
Nicer interface in Ivy.
#+begin_src emacs-lisp
(use-package ivy-rich
  :init
  (ivy-rich-mode 1))
#+end_src
* Latex
https://www.gnu.org/software/auctex/manual/auctex.index.html
#+begin_src emacs-lisp
  (use-package auctex
    :ensure t
    :defer t)
    ;; :hook (visual-line-mode . LaTeX-mode)
    ;; :hook (follow-mode . LaTeX-mode)
    ;; :hook (flyspell-mode . LaTeX-mode)
    ;; :hook (LaTeX-math-mode . LaTeX-mode))

  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil)
#+end_src

* Lsp
https://emacs-lsp.github.io/lsp-mode/
** Lsp mode
This is the basic configuration. Each language section is going to have its own configuration too.
#+begin_src emacs-lisp
(setq lsp-keymap-prefix "C-l")

(use-package lsp-mode
  :ensure t
  :custom
  (lsp-prefer-flymake nil)
  :hook (lsp-mode . lsp-enable-which-key-integration)
  :commands (lsp lsp-deferred))

(use-package lsp-ui
  :after lsp-mode
  :diminish
  :commands lsp-ui-mode)

(use-package lsp-ivy
  :commands lsp-ivy-workspace-symbol)

(use-package lsp-treemacs
  :commands lsp-treemacs-errors-list)
#+end_src

** Dap-mode
Debugging mode.
https://emacs-lsp.github.io/dap-mode/
*** Configuration
#+begin_src emacs-lisp
(use-package general)
(use-package dap-mode
  :ensure t
  :custom
  (dap-auto-configure-features '(sessions locals tooltop expressions repl))
  :config
  (dap-ui-mode 1)
  (general-define-key
    :keymaps 'lsp-mode-map
    :prefix lsp-keymap-prefix
    "d" '(dap-hydra t :wk "debugger")))
#+end_src

*** Useful commands/actions
+ Create debugging template if necessary
+ It's possible to choose manually what panels to show.
+ dap-ui-expression-add: adds an expression or variable to be followed in the "expressions" view.
+ dap-ui-expression-remove: remove an expression
+ dap-ui-repl: opens a language shell in the current state of the program
+ dap-tooltip-at-point: pops up the value of a variable
  
*** References
https://www.youtube.com/watch?v=0bilcQVSlbM

* Magit
#+begin_src emacs-lisp
(use-package magit
  :defer t
  :commands (magit-status magit-get-current-branch)
  )

(use-package evil-magit
  :after magit)
#+end_src
* Org mode
https://orgmode.org/
** Base
#+begin_src emacs-lisp
(use-package org
  :hook (org-mode . bretx/org-mode-hooks)
  :config
  (setq org-hide-emphasis-markers t
        org-ellipsis " ▾"
	    org-startup-folded 'content
	    org-cycle-separator-lines 2))

(require 'org-indent)
#+end_src

** Keybindings
#+begin_src emacs-lisp
(define-key org-mode-map (kbd "C-<return>") 'org-open-at-point)
#+end_src

** Superstar/Bullets
https://github.com/integral-dw/org-superstar-mode
#+begin_src emacs-lisp
(use-package org-superstar
  :after org
  :hook (org-mode . org-superstar-mode)
  :custom
  (org-superstar-remove-leading-stars t)
  (org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src

** Table of contents
https://github.com/snosov1/toc-org
#+begin_src emacs-lisp
(use-package toc-org)
#+end_src

** Faces
#+begin_src emacs-lisp
(dolist (face '((org-level-1 . 1.2)
                (org-level-2 . 1.1)
                (org-level-3 . 1.05)
                (org-level-4 . 1.0)
                (org-level-5 . 1.1)
                (org-level-6 . 1.1)
                (org-level-7 . 1.1)
                (org-level-8 . 1.1))))
#+end_src
** Hooks
#+begin_src emacs-lisp
(defun bretx/org-mode-hooks ()
  "Hooks for org mode."
  (org-indent-mode)
  (toc-org-mode 1)
  (smartparens-mode 1)
  (visual-line-mode 1))
#+end_src

** Babel
Run code inside org.
#+begin_src emacs-lisp
(org-babel-do-load-languages 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)))

;; Run the blocks when requested
(setq org-confirm-babel-evaluate nil)

;; Shortcuts to create the blocks for specific languages
(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
#+end_src

* Origami
https://github.com/gregsexton/origami.el
#+begin_src emacs-lisp
  ;; (use-package origami)
  ;; (global-origami-mode t)
#+end_src
* Pdf tools
https://github.com/politza/pdf-tools
#+begin_src emacs-lisp
(use-package pdf-tools
  :defer t)
#+end_src
* Projectile
https://github.com/bbatsov/projectile
** Base
#+begin_src emacs-lisp
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/Projects")
    (setq projectile-project-search-path '("~/Projects" "~/Documents")))
  (setq counsel-projectile-switch-project-action 'ranger)
)

(require 'projectile)
(projectile-mode)
#+end_src

** Counsel projectile
Better integration between counsel and projectile. Alt-o to activate
#+begin_src emacs-lisp
(use-package counsel-projectile
  :config (counsel-projectile-mode))
#+end_src

** keybindings
| Key       | Action              |
|-----------+---------------------|
| C-c p s r | ripgrep the project |
| C-c p k   | kill all buffers    |

* Python
Python lsp.
https://github.com/palantir/python-language-server
#+begin_src emacs-lisp
(use-package python-mode
  :defer t
  :hook (python-mode . lsp-deferred)
  :config
  (require 'dap-python)
  (define-key python-mode-map (kbd "<return>") 'newline)
  (elpy-enable))
#+end_src

Alternative: elpy
https://elpy.readthedocs.io/en/latest/index.html
#+begin_src emacs-lisp
(use-package elpy
  :ensure t
  :init
  (elpy-enable)
  :config
  (elpy-set-test-runner 'py.test))
#+end_src

Virtual environments in Emacs.
https://github.com/jorgenschaefer/pyvenv
#+begin_src emacs-lisp
(use-package pyvenv
  :defer t
  :ensure t)
#+end_src

* Rainbow delimiters
Colors for parenthesis
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode)
  :hook (LaTeX-mode . rainbow-delimiters-mode))
#+end_src

* Ranger
Emulates Ranger behavior within Emacs.
https://github.com/ralesi/ranger.el
#+begin_src emacs-lisp
(use-package ranger
  :defer t
  :ensure t
  :commands ranger
  :config (use-package image-dired+
            :ensure t
            :config (image-diredx-async-mode)))

(ranger-override-dired-mode t)
(setq ranger-show-hidden nil)
#+end_src

* Smart parens
#+begin_src emacs-lisp
(use-package smartparens)
(smartparens-global-mode 1)
  ;; :hook (prog-mode . smartparens-mode)
  ;; :hook (LaTeX-mode . smartparens-mode))

(show-paren-mode t)
(setq show-paren-delay 0)
#+end_src

